# Student Data 
This notebook analyzes pass/fail data for a class

In [1]:
data = [50,34,56,23,43,56,89,65,45,97,87,67,67,89,67,98,76,75,64]

In [2]:
import numpy as np # type: ignore
import pandas as pd # type: ignore
import wget # type: ignore
grades_file = wget.download('https://raw.githubusercontent.com/MicrosoftDocs/mslearn-introduction-to-machine-learning/main/Data/ml-basics/grades.csv')

In [3]:
df_students = pd.read_csv(grades_file,delimiter=',',header='infer')
df_students.head()

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

In [4]:
df_students.isnull().sum()

Name          0
StudyHours    1
Grade         2
dtype: int64

In [5]:
df_students = df_students.dropna(axis=0)

In [6]:
mean_study = df_students.StudyHours.mean()
mean_grade = df_students.Grade.mean()

print(f'Average study hours: {mean_study}\nAverage grade: {mean_grade}')

Average study hours: 10.522727272727273
Average grade: 49.18181818181818

In [7]:
df_students[df_students.StudyHours > mean_study]

         Name  StudyHours  Grade
1       Joann       11.50   50.0
3       Rosie       16.00   97.0
6    Frederic       11.50   53.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [8]:
df_students[df_students.StudyHours > mean_study].Grade.mean()

np.float64(66.7)

In [9]:
passed = pd.Series(df_students['Grade'] > 60)
df_students = pd.concat([df_students, passed.rename('Pass')], axis=1)
df_students

         Name  StudyHours  Grade   Pass
0         Dan       10.00   50.0  False
1       Joann       11.50   50.0  False
2       Pedro        9.00   47.0  False
3       Rosie       16.00   97.0   True
4       Ethan        9.25   49.0  False
5       Vicky        1.00    3.0  False
6    Frederic       11.50   53.0  False
7      Jimmie        9.00   42.0  False
8      Rhonda        8.50   26.0  False
9    Giovanni       14.50   74.0   True
10  Francesca       15.50   82.0   True
11      Rajab       13.75   62.0   True
12    Naiyana        9.00   37.0  False
13       Kian        8.00   15.0  False
14      Jenny       15.50   70.0   True
15     Jakeem        8.00   27.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
18      Anila       10.00   48.0  False
19       Skye       12.00   52.0  False
20     Daniel       12.50   63.0   True
21      Aisha       12.00   64.0   True

In [10]:
df_students.groupby(df_students.Pass).Name.count()

Pass
False    15
True      7
Name: Name, dtype: int64

In [11]:
df_students.groupby(df_students.Pass).Grade.mean()

Pass
False    38.000000
True     73.142857
Name: Grade, dtype: float64

In [12]:
df_students.groupby(df_students.Pass)[['StudyHours','Grade']].mean()

       StudyHours      Grade
Pass
False    8.783333  38.000000
True    14.250000  73.142857